{
    "name": "Allah Loves",
    "organization": "Yaqeen Institute",
    "speakers": ["Omar Suleiman"],
    "url": "omar-suleiman-allah-loves",
    "year": "2019",
    "islamic_year": "1440",
    "episodes": [
        {
            "name": "Allah Loves Piety",
            "episode": 1,
            "description":"The most frequent reference in the Qur'an to the love of Allah is in relation to Taqwa, piety. In this episode, we explore what piety is and how to attain it.",
            "youtube_id": "CQ_xUX-WshE",
            "url": "https://youtu.be/CQ_xUX-WshE"
        },
        {
            "name": "Allah Loves Repentance",
            "episode": 2,
            "description":"Every single one of the Children of Adam is a sinner.” But no matter how far down we fall, it’s never outside of the bounds of Allah’s love and mercy. In this episode, we review how the process of repentance is actually meant to strengthen your relationship with Allah.",
            "youtube_id": "fZuN2O3ucs4",
            "url": "https://youtu.be/fZuN2O3ucs4"
        },
        {
            "name": "Allah Loves Excellence",
            "episode": 3,
            "description":"You don’t just want to love Allah, you want to be in love with Allah. While Taqwa keeps us on track with our obligatory duties, excellence is going the extra mile and earning more of Allah’s love in the process.",
            "youtube_id": "ASdgNcbDrmI",
            "url": "https://youtu.be/ASdgNcbDrmI"
        },
        {
            "name": "Allah Loves Angelic Praise",
            "episode": 4,
            "description":"What are the two expressions that are light on the tongue, heavy in our scales, and beloved to the Most Merciful? In this episode, we identify the words with which Allah loves to be praised, and how angelic they actually are.",
            "youtube_id": "YprfWkHUUlA",
            "url": "https://youtu.be/YprfWkHUUlA"
        },
        {
            "name": "Allah Loves Sincere Supplication",
            "episode": 5,
            "description":"Allah loves to hear your voice. Not only does praising Him bring you closer to Him - so does your asking of Him. In this episode, we talk about the greatest answer to a sincere supplication.",
            "youtube_id": "ExaOjcrqwWk",
            "url": "https://youtu.be/ExaOjcrqwWk"
        },
        {
            "name": "Allah Loves Those Who Are Trying",
            "episode": 6,
            "description":"Sh. Omar Suleiman discusses the importance of always being in the process of repentance even when we feel ashamed to turn back to Allah.",
            "youtube_id": "LH8VcTyqTtY",
            "url": "https://youtu.be/LH8VcTyqTtY"
        },
        {
            "name": "Allah Loves Tears and Traces",
            "episode": 7,
            "description":"The eyes shed tears of brokenness and vulnerability and the body shows signs of wear and tear. This episode discusses how enduring physical discomfort in pursuit of good makes us beloved to Allah.",
            "youtube_id": "nYzKjil2hJs",
            "url": "https://youtu.be/nYzKjil2hJs"
        },
        {
            "name": "Allah Loves Trust",
            "episode": 8,
            "description":"There are times in our lives when no matter how much we pray and repent, things just don’t seem to go right. This episode explores how we can maintain trust in Allah, even during the most difficult times in our life.",
            "youtube_id": "qWjaVJzk8_Q",
            "url": "https://youtu.be/qWjaVJzk8_Q"
        },
        {
            "name": "Allah Loves Patience",
            "episode": 9,
            "description":"Most people who enter Jannah will not do so because of a good deed they committed, but because of the patience they showed during hardship. We review the different forms of patience beloved to Allah.",
            "youtube_id": "BKIxv5kyQec",
            "url": "https://youtu.be/BKIxv5kyQec"
        },
        {
            "name": "Allah Loves Justice",
            "episode": 10,
            "description":"When we speak about justice, we often think about rulers, authority, or governments. However, we’re given several opportunities each day to either be a vehicle for justice or to uphold it in our own immediate lives.",
            "youtube_id": "Yl5KYd0l8cM",
            "url": "https://youtu.be/Yl5KYd0l8cM"
        },
        {
            "name": "Allah Loves Beneficial People",
            "episode": 11,
            "description":"Serving as a vehicle of Allah's love to someone else's life is one of the best ways to earning His love yourself. This episode provides different ways we can be beneficial to others.",
            "youtube_id": "wVY-uDlWp70",
            "url": "https://youtu.be/wVY-uDlWp70"
        },
        {
            "name": "Allah Loves Strength",
            "episode": 12,
            "description":"\"In all of them is good\". Both strong and weak believers are capable of receiving Allah's love. However, strength is especially beloved by Him. This episode explains why.",
            "youtube_id": "2nYhIdJdQdM",
            "url": "https://youtu.be/2nYhIdJdQdM"
        },
        {
            "name": "Allah Loves Independence",
            "episode": 13,
            "description":"Allah loves the person who, even in his/her most difficult situations, tries to be as self-sufficient as possible. In this episode, we explore the importance of adapting a mindset of independence.",
            "youtube_id": "AA8FTg70i2A",
            "url": "https://youtu.be/AA8FTg70i2A"
        },
        {
            "name": "Allah Loves Healthy Pride",
            "episode": 14,
            "description":"Pride was the downfall of Satan and has caused the collapse of entire nations. So how can pride be loved by Allah? This episode explains the unique type of self-confidence favored by Him.",
            "youtube_id": "8EZAD6iAT24",
            "url": "https://youtu.be/8EZAD6iAT24"
        },
        {
            "name": "Allah Loves Honor",
            "episode": 15,
            "description":"There is a protective honor that Allah loves that is distinguished from jealousy and doesn’t descend into suspicion. It’s not envy over this world, but motivated by the pursuit of the hereafter.",
            "youtube_id": "Abo5heb9clI",
            "url": "https://youtu.be/Abo5heb9clI"
        },
        {
            "name": "Allah Loves Gentleness",
            "episode": 16,
            "description":"\"Allah is Gentle and He loves gentleness in all affairs.\" This episode illustrates the example of Prophet Muhammad's composure and gentleness with those who taunted him, even at the height of his power.",
            "youtube_id": "9LlohFkpoy8",
            "url": "https://youtu.be/9LlohFkpoy8"
        },
        {
            "name": "Allah Loves Humility",
            "episode": 17,
            "description":"Similar to pride, humility can either be a positive or negative attribute. This episode compares the two types of humility and how to apply healthy humility in the world today.",
            "youtube_id": "3HHyxzEdu4g",
            "url": "https://youtu.be/3HHyxzEdu4g"
        },
        {
            "name": "Allah Loves Forbearance and Deliberation",
            "episode": 18,
            "description":"Forbearance and deliberation flow from the same fountain. This episode tells a special story about the Prophet Muhammad and his companions to illustrate Allah's love for these two qualities.",
            "youtube_id": "OcAcHO1Vffo",
            "url": "https://youtu.be/OcAcHO1Vffo"
        },
        {
            "name": "Allah Loves Due Diligence",
            "episode": 19,
            "description":"If you have due diligence in your work ethic, it speaks to a greater sense of excellence and motivation. This episode discusses how we can apply this quality to our work in the same way we apply it in our worship.",
            "youtube_id": "La21hdrTSHU",
            "url": "https://youtu.be/La21hdrTSHU"
        },
        {
            "name": "Allah Loves Consistency",
            "episode": 20,
            "description":"Most people experience a drop off after Ramadan. This episode provides tips on how to remain consistent to show Him your love and earn it in return.",
            "youtube_id": "gTptBJsUFAA",
            "url": "https://youtu.be/gTptBJsUFAA"
        },
        {
            "name": "Allah Loves Punctual Prayer",
            "episode": 21,
            "description":"If consistency is the most beloved quality of good deeds, then what is the most beloved good deed? This episode discusses prayer, the most fundamental pillar of Islam, and what makes punctual prayer in particular so special to Allah.",
            "youtube_id": "rkN0G-I30OU",
            "url": "https://youtu.be/rkN0G-I30OU"
        },
        {
            "name": "Allah Loves Cleanliness",
            "episode": 22,
            "description":"\"Cleanliness is half of faith\". This episode defines purity beyond the ritual of wudu (ablution).",
            "youtube_id": "OqyUCFzHKZ8",
            "url": "https://youtu.be/OqyUCFzHKZ8"
        },
        {
            "name": "Allah Loves The Mosques",
            "episode": 23,
            "description":"The most beloved of places to Allah is the mosque. This episode describes the importance of the masjid and why no other place can replace the role it should have in our lives.",
            "youtube_id": "woHeNtg9cRM",
            "url": "https://youtu.be/woHeNtg9cRM"
        },
        {
            "name": "Allah Loves Love",
            "episode": 24,
            "description":"As we've seen through this series, Allah loves many things. But he also loves love itself! This episode discusses the most beloved form of love to Allah - love for His sake.",
            "youtube_id": "iPXJPoi8Tno",
            "url": "https://youtu.be/iPXJPoi8Tno"
        },
        {
            "name": "Allah Loves Your Mother",
            "episode": 25,
            "description":"There is no one in your life like your mother. This episode explores the status of the mother in Islam and what makes her so special to Allah.",
            "youtube_id": "SGRJfC2xofA",
            "url": "https://youtu.be/SGRJfC2xofA"
        },
        {
            "name": "Allah Loves The Unnoticed ",
            "episode": 26,
            "description":"The closest ones to Allah are hidden gems in our community. This episode describes why those who often go unnoticed in social gatherings are noticed and loved by Him.",
            "youtube_id": "AmwBDOjM1AE",
            "url": "https://youtu.be/AmwBDOjM1AE"
        },
        {
            "name": "Allah Loves Generosity in Trade",
            "episode": 27,
            "description":"Negotiation is a natural part of all business dealings. This episode explains how we can be gentle in buying, selling and repayment of debt.",
            "youtube_id": "M8CEqFlDIoo",
            "url": "https://youtu.be/M8CEqFlDIoo"
        },
        {
            "name": "Allah Loves Being Prophetic",
            "episode": 28,
            "description":"Nearly every single quality we've covered in this series has 1 thing in common. In addition to being loved by Allah, they're all embodied in the character of our Prophet Muhammad. This episode discusses how we can strive to be more like him.",
            "youtube_id": "hAI0CBwYIxs",
            "url": "https://youtu.be/hAI0CBwYIxs"
        },
        {
            "name": "Allah Loves Acceptance of His Gifts ",
            "episode": 29,
            "description":"\"Allah loves that you accept his concessions.\" This episode describes why sometimes the one who takes an easier option provided by Allah is more beloved to Him than the one who endures greater struggle.",
            "youtube_id": "vqVgB9KND4A",
            "url": "https://youtu.be/vqVgB9KND4A"
        },
        {
            "name": "Allah Loves Beauty",
            "episode": 30,
            "description":"\"Allah is beautiful and He loves beauty.\" This final episode describes why Allah loves to see traces of His blessings on us and how we can do so without being overly extravagant. May Allah make all of us who are beloved by Him. Eid Mubarak!",
            "youtube_id": "DS0GmQbzk-E",
            "url": "https://youtu.be/DS0GmQbzk-E"
        }
    ]
}