{
    "name": "Angels in Your Presence",
    "organization": "Yaqeen Institute",
    "speakers": ["Omar Suleiman"],
    "url": "omar-suleiman-angels-in-your-presence",
    "year": "2020",
    "islamic_year": "1441",
    "episodes": [
        {
            "name": "They’ve Got Your Back",
            "episode": 1,
            "description":"Do we have such a thing as guardian angels? What do they do, and how do we experience them?",
            "youtube_id": "9VtsVxVyn1g",
            "url": "https://youtu.be/9VtsVxVyn1g"
        },
        {
            "name": "Hold Your Pens",
            "episode": 2,
            "description":"We have two angels that record our deeds, but did you know that Allah sometimes tells the angel to not write down what you’ve done?",
            "youtube_id": "swoO1nd2VKw",
            "url": "https://youtu.be/swoO1nd2VKw"
        },
        {
            "name": "Fasting While Others Eat",
            "episode": 3,
            "description":"Have you ever felt extra challenged while fasting around people who are eating? You’re also extra blessed!",
            "youtube_id": "W7gEyqqSPpU",
            "url": "https://youtu.be/W7gEyqqSPpU"
        },
        {
            "name": "Sleep Well",
            "episode": 4,
            "description":"Every night as you go to bed, an angel and a devil start to prompt you. Who will you listen to?",
            "youtube_id": "mOuiRGRIhak",
            "url": "https://youtu.be/mOuiRGRIhak"
        },
        {
            "name": "Switching Shifts",
            "episode": 5,
            "description":"How does the way that you sleep affect the way that you wake up? And what happens when the angels gather at Fajr?",
            "youtube_id": "NDfvYIG4Dr4",
            "url": "https://youtu.be/NDfvYIG4Dr4"
        },
        {
            "name": "As You Step Out",
            "episode": 6,
            "description":"When you’re about to step out into the world, and you say this prayer, you will be protected...\\n\\nبسم الله، توكلت على الله، لا حول ولا قوة إلا بالله\\n\\nBismillah, tawakkaltu ’ala Allah, wa la hawla wa la quwwata illa-billah\\n\\nIn the name of Allah, I’ve put my trust in Allah, and there is no power or might except that which belongs to Allah.",
            "youtube_id": "wHYlw82qDAE",
            "url": "https://youtu.be/wHYlw82qDAE"
        },
        {
            "name": "The Banner Above You",
            "episode": 7,
            "description":"You will have an angel’s reins on your head throughout the day, and a banner awaits you to be carried above.",
            "youtube_id": "gOtXMstUHCU",
            "url": "https://youtu.be/gOtXMstUHCU"
        },
        {
            "name": "Responding to Your Haters",
            "episode": 8,
            "description":"The greatest test of good character is how one deals with someone with bad character. The greatest blessing of resisting aggression, is gaining the support of the angels.",
            "youtube_id": "wuhFCf6eifE",
            "url": "https://youtu.be/wuhFCf6eifE"
        },
        {
            "name": "Your Brother’s Honor",
            "episode": 9,
            "description":"What kind of society are we creating if we’re expected to tolerate bad behavior? It depends on how you handle it towards others...",
            "youtube_id": "rMCbdcH3qSk",
            "url": "https://youtu.be/rMCbdcH3qSk"
        },
        {
            "name": "The Honor of Your Prophet",
            "episode": 10,
            "description":"What is the connection between defending the honor of your brother and the honor of the Prophet ﷺ? And what is the best way to do that?",
            "youtube_id": "Ulkz2JIAqEw",
            "url": "https://youtu.be/Ulkz2JIAqEw"
        },
        {
            "name": "Ameen and For You As Well",
            "episode": 11,
            "description":"There is a connection to praying for your brother behind his back and defending his honor behind his back. There are also etiquettes and benefits that are often missed in doing so. What’s the best way to pray for someone?",
            "youtube_id": "MXWlFL4fWI4",
            "url": "https://youtu.be/MXWlFL4fWI4"
        },
        {
            "name": "The Best Supplication",
            "episode": 12,
            "description":"What if the only du’a you made was salawat on our Prophet Muhammad ﷺ? Learn more about how the angels respond to the prayer for our most noble brother ﷺ.",
            "youtube_id": "rD35Sxb1ips",
            "url": "https://youtu.be/rD35Sxb1ips"
        },
        {
            "name": "Be Fair When You Judge",
            "episode": 13,
            "description":"What do the angels do when we are called to judge between two disputing parties?",
            "youtube_id": "NxId-O4hdi0",
            "url": "https://youtu.be/NxId-O4hdi0"
        },
        {
            "name": "The Seeker of Knowledge",
            "episode": 14,
            "description":"The path of knowledge is the path to paradise. The angels lower their wings out of humility to the seeker of knowledge in a special way. But what qualifies as seeking? And what benefits come through it?",
            "youtube_id": "biYiQw1-lP4",
            "url": "https://youtu.be/biYiQw1-lP4"
        },
        {
            "name": "No Strings Attached",
            "episode": 15,
            "description":"If you love someone for the sake of Allah, does that mean you only love them for the sake of Allah? Do you check on people only when you want something from them?",
            "youtube_id": "MkA0N1mKkCY",
            "url": "https://youtu.be/MkA0N1mKkCY"
        },
        {
            "name": "The Ultimate Healer",
            "episode": 16,
            "description":"There are angels that visit you when you are sick and monitor how you react to other visitors. What rewards lay in store for those who are patient with their illness?",
            "youtube_id": "zp25hPc_ARc",
            "url": "https://youtu.be/zp25hPc_ARc"
        },
        {
            "name": "An Entourage of 70,000",
            "episode": 17,
            "description":"Imagine having 70,000 of these blessed creatures follow you throughout the day seeking forgiveness for you. Why is the reward for visiting the sick so unique?",
            "youtube_id": "S6IMKQN-raA",
            "url": "https://youtu.be/S6IMKQN-raA"
        },
        {
            "name": "When Your Loved Ones Are Dying",
            "episode": 18,
            "description":"Have you ever been around a dying loved one and noticed a presence in the room? As your loved ones breathe their last breaths, your supplications are witnessed by the angels.\\n\\nاللهم اغفر لأبي سلمه، وارفع درجته في المهديين،واخلفه في عقبه في الغابرين، واغفر لنا وله يا رب العالمين، وافسح له في قبره، ونور له فيه\\n\\n\\“O Allah! Forgive Abu Salamah, raise his rank among those who are rightly-guided and grant him a successor from his descendants who remain behind. Grant him pardon and us, too. Oh Lord of the worlds. Make his grave spacious for him and give him light in it.\\”",
            "youtube_id": "bLZHi1dzaq0",
            "url": "https://youtu.be/bLZHi1dzaq0"
        },
        {
            "name": "Have You Ever Seen an Angel in Human Form?",
            "episode": 19,
            "description":"Have you ever met a human being and thought they must be an angel? You may be right, but you may also be missing the point.",
            "youtube_id": "tMcmq1YAhD4",
            "url": "https://youtu.be/tMcmq1YAhD4"
        },
        {
            "name": "A Caller from Heaven’s Gates",
            "episode": 20,
            "description":"This is a Hadith you probably haven’t heard yet in a fundraiser. Charity should be a daily habit in our lives. We should never underestimate the blessings we gain through it, blessings we may have not considered.",
            "youtube_id": "Fc1t2IldkI4",
            "url": "https://youtu.be/Fc1t2IldkI4"
        },
        {
            "name": "The First Rows",
            "episode": 21,
            "description":"What is the significance of the first rows in the Masjid? Are they physically the first rows or do they encompass something deeper?",
            "youtube_id": "FTGXjHKxY3w",
            "url": "https://youtu.be/FTGXjHKxY3w"
        },
        {
            "name": "The Friday Roll Book",
            "episode": 22,
            "description":"The angels have a roll book on Jumah, and the early Jumah-goers have a reserved spot in Paradise.",
            "youtube_id": "807zhhtX_2k",
            "url": "https://youtu.be/807zhhtX_2k"
        },
        {
            "name": "From Prayer to Prayer",
            "episode": 23,
            "description":"What you do before, after, and in between prayers make or break the quality of them. How can we structure our prayers in a way that allows for the angels to remain with us for as long as possible?",
            "youtube_id": "t9mTmq0ifXw",
            "url": "https://youtu.be/t9mTmq0ifXw"
        },
        {
            "name": "Struggling to Recite",
            "episode": 24,
            "description":"Allah loves to see you trying. When you struggle for Allah’s sake, the reward is greater. What do the angels do when you struggle to read Quran?",
            "youtube_id": "BJ1SIz2koAI",
            "url": "https://youtu.be/BJ1SIz2koAI"
        },
        {
            "name": "From Your Mouth to an Angel’s Heart",
            "episode": 25,
            "description":"The angels grasped what they could of the Quran in their hearts with its initial revelation, and they look for it with every recitation. This hadith will give you and entirely different dimension of the power of your recitation, and make you want to always brush your teeth before reading.",
            "youtube_id": "0cCnVGwluxg",
            "url": "https://youtu.be/0cCnVGwluxg"
        },
        {
            "name": "When Jibreel Descends Upon You",
            "episode": 26,
            "description":"The angels descend and attend our worship and Qur’anic recitations on Laylatul Qadr. What does it take to bring Jibreel to your house?",
            "youtube_id": "bB5fyYuWYXY",
            "url": "https://youtu.be/bB5fyYuWYXY"
        },
        {
            "name": "The Heavens are Creaking",
            "episode": 27,
            "description":"The angels compete with each other to be the one to catch your praise and record it. What is the best way to praise Allah, and how do the angels receive it?",
            "youtube_id": "J3LKARd4myE",
            "url": "https://youtu.be/J3LKARd4myE"
        },
        {
            "name": "In Your Room Praying Behind You",
            "episode": 28,
            "description":"When you pray at home, angels the size of mountains pray behind you. How can we best reap the rewards of such a gathering?",
            "youtube_id": "DyjbwAZ47YI",
            "url": "https://youtu.be/DyjbwAZ47YI"
        },
        {
            "name": "Gatherings of Remembrance",
            "episode": 29,
            "description":"Both worshiping in a gathering and worshiping alone have their benefits, but there are more angels in gatherings bearing witness to your worship. What are blessed gatherings? And how blessed are they?",
            "youtube_id": "fI-vTVeMVe8",
            "url": "https://youtu.be/fI-vTVeMVe8"
        },
        {
            "name": "When Allah Loves You",
            "episode": 30,
            "description":"When Allah loves you, He makes sure the angels do as well. The righteous then love you as well. But does this mean fame alone is a sign of Allah’s love?",
            "youtube_id": "Cg1sHCbzqbg",
            "url": "https://youtu.be/Cg1sHCbzqbg"
        }
    ]
}