{
    "name": "Prayers of the Pious",
    "organization": "Yaqeen Institute",
    "speakers": ["Omar Suleiman"],
    "url": "omar-suleiman-prayers-of-the-pious",
    "year": "2018",
    "islamic_year": "1439",
    "episodes": [
        {
            "name": "The Best of My Days",
            "episode": 1,
            "description":"In the first episode of the Prayers of the Pious series, Sh. Omar Suleiman considers the righteous du'a that Abu Bakr made at the end of his lifetime.\n[ Day 1 Du'a ]\nاللَّهُمَّ اجْعَلْ خَيْرَ زَمَانِيْ آخِرَهُ، وَخَيْرَ عَمَلِيْ خَوَاتِمَهُ، وَخَيْرَ أَيَّامِيْ يِوْمَ أَلقَاكَ\n/“O Allah, let the best of my lifetime be its ending, and my best deed be that which I seal [my life with], and the best of my days the day I meet You.”",
            "youtube_id": "bB595IJMmSY",
            "url": "https://youtu.be/bB595IJMmSY"
        },
        {
            "name": "His Door is Always Open",
            "episode": 2,
            "description":"Sh. Omar Suleiman examines the importance of persistent du'a, like that of Habiba al Adawiya, and how to get personal with Allah.\n[ Day 2 Du'a ]\nغَارَت النُّجُوْمُ، وَنَامَت العُيُوْنُ وَغَلَّقَت المُلُوْكُ أَبْوَابَهَا، وَبَابُكَ مَفْتُوْحٌ، وَخَلا كُلُ حَبِيْبٍ بِحَبِيْبِهِ، وَهَذَا مَقَامِي بَيْنَ يَدَيْكَ\nAfter Isha: “O Allah, the stars have vanished, the eyes have slept, the kings have locked their doors, and Your door remains open. Every lover has found privacy with their beloved, and here I am standing before You.”",
            "youtube_id": "FtobhFb9hEo",
            "url": "https://youtu.be/FtobhFb9hEo"
        },
        {
            "name": "A Covenant with Allah",
            "episode": 3,
            "description":"Sh. Omar Suleiman discusses the power of making covenants with Allah through the prayer of Abdullah ibn Mas’oud, and the sincerity covenants can bring to your own du'a. \n[ Day 3 Du'a ]\nاللهُمَّ فَاطِرَ السَّمَاوَاتِ وَالأَرْضَ ، عَالمَ الغَيْبِ وَالشَّهَادَةِ ، إِنِّي أَعْهَدُ إَلَيْكَ فِي هَذِهِ الحَيَاةِ الدُنْيَا : إِنَّكَ إِنْ تَكِلْنِي إِلَى نَفْسِيْ تُقَرِّبُنِي مِنْ الشَّرِّ ، وَتُبَاعِدُنِي مِنْ الخَيْرِ ، وَإِنِّي إِنْ أَثِقُ إِلَّا بِرَحْمَتِكَ فَاجْعَلْهُ لِي عِنْدَكَ عَهْدَاً تُؤَدِّهِ إِلَيَّ يَوْمَ القِيَامَةِ ، إِنَّكَ لَا تُخْلِفُ المِيْعَادَ\n“O Allah, Originator of the heavens and earth, Knower of the seen and unseen, I testify in this worldly life of mine that if You leave me to myself, You are by that bringing my closer to harm and distancing me from good. I have no confidence except in Your mercy, so let that be a covenant that You deliver to me on the Day of Judgment — for You never break Your promises.”",
            "youtube_id": "DUq2k6GRgWY",
            "url": "https://youtu.be/DUq2k6GRgWY"
        },
        {
            "name": "Enormity of My Sins vs His Mercy",
            "episode": 4,
            "description":"In this episode, we observe the du’a of a complicated character, Abdul Malik ibn Marwan, and how we can improve the quality of our du’as when asking for forgiveness from Allah.\n[ Day 4 Du'a ]\nيَا رَبِّ إِنَّ ذُنُوْبِي عَظِيْمَةٌ ، وَإِنَّ قَلِيْلَ عَفْوِكَ أَعْظَمُ مِنْهَا ، اللَّهُمَّ فَامْحِ بِقَلِيْلِ عَفْوِكَ عَظِيْمَ ذُنُوْبِي \n“My Lord, my sins are enormous, but a little of Your forgiveness is greater than them. O Allah, so erase with a little of Your forgiveness my enormous sins.”",
            "youtube_id": "o6bTkljwyJc",
            "url": "https://youtu.be/o6bTkljwyJc"
        },
        {
            "name": "The Hand That Kills Me",
            "episode": 5,
            "description":"A du’a can make even the most unlikely circumstances occur, such as in the case of Umar and his martyrdom.\n[ Du'a Day 5 ] \n اللهُمَّ ارْزٌقْنِيْ شَهَادَةً فِيْ سَبِيْلِكَ وَاجْعَلْ مَوْتِيْ فِيْ بَلَدِ رَسُوْلِكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ \nاللَّهُمَّ لا تَجْعَلْ قَتْلِيْ عَلَى يَدِ عَبْدٍ سَجَدَ لَكَ سَجْدَةً يَحَاجُّنِيْ بِهَا يَوْمَ القِيَامَةِ\n“O Allah I ask you to be accepted as a martyr in the city of your Prophet.”\n“O Allah, do not let my killing be at the hand of someone who ever prostrated to You, lest he use that against me on the Day of Judgment.”",
            "youtube_id": "guL5d9AOaL4",
            "url": "https://youtu.be/guL5d9AOaL4"
        },
        {
            "name": "The Highest Companionship in the Highest Garden",
            "episode": 6,
            "description":"This episode is about the sincere du'a of Abdullah ibn Mas’oud, on the beautiful occasion when the Prophet ﷺ listened to his prayers to be among his companions. \n[ Day 6 Du'a ]\nاللَّهُمَّ إِنِّيْ أَسْأَلُكَ إِيْمَانًا لا يَرْتَدُّ ، وَنِعِيْمًا لا يَنْفَدُ ، وَمُرَافَقَةَ نَبِيِّكَ مُحَمَّدٍ ـ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ـ فِي أَعْلَى جَنَّةِ الخُلْدِ\n“O Allah, I ask You for faith that does not unravel, and delight that never depletes, and the companionship of Your prophet Muhammad ﷺ in the highest eternal garden.”",
            "youtube_id": "v-wC7JlqiFA",
            "url": "https://youtu.be/v-wC7JlqiFA"
        },
        {
            "name": "O Allah, You Know That I Love You",
            "episode": 7,
            "description":"This episode covers the du'a of Hudhaifa ibn al-Yaman, whose love of Allah inspires us to love Him and ask Him for his love. \n[ Day 7 Du'a]\nاللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ صَبَاحِ النَّارِ وَمِنْ مَسَائِهَا ، وَلمَّا نَزَلَ بِهِ المَوْتُ قَالَ: هَذِهِ آخِرُ سَاعَةٍ مِنْ الدُّنْيَا، اللَّهُمَّ إِنِّكَ تَعْلَمُ أَنِّيْ أُحِبُّكَ فَبَارِكْ لِيْ فِي لِقَائِكَ\n“O Allah, I seek shelter with You from mornings and evenings in the Hellfire.”\n“This is my last hour in this world. O Allah, You know that I certainly love You, so bless my meeting with You.”",
            "youtube_id": "r5r1terTVJY",
            "url": "https://youtu.be/r5r1terTVJY"
        },
        {
            "name": "The Precious Prayer of A Mother",
            "episode": 8,
            "description":"Sh. Omar Suleiman identifies a du'a by Asmaa bint Abi Bakr for her son, illustrating the power of du'a from mothers and those who are oppressed.\n[ Day 8 Du'a ]\nاللَّهُمَّ ارْحَمْ طُوْلَ ذَلِكَ القِيِامَ فِي اللَّيْلِ الطَّوِيْلِ، وَذَلِكَ النَّحِيْبُ وَالظَّمَأُ فِي هَوَاجِرِ المَدِيْنَةِ وَمَكَّةَ، وَبِرَّهُ بِأَبِيْهِ وِبِيْ. اللَّهُمَّ قَدْ سَلَّمْتُهُ لِأَمْرِكَ فِيْهِ، وَرَضِيْتُ بِمَا قَضَيْتَ فَأَثِبْنِي فِي عَبْدِ اللهِ ثَوَابَ الصَّابِرِيْنَ الشَّاكِرِيْنَ\n“O Allah, have mercy on his lengthy standing during the longest nights, and that whimpering, and his thirst during the hot summer days of Mecca and Madinah, and his kindness to his father and to me. O Allah, I have surrendered him to whatever You decree on him, and am content with whatever You have decided, so reward me for ‘Abdullah the reward of the patient and thankful.”",
            "youtube_id": "KvyQBt4uSsw",
            "url": "https://youtu.be/KvyQBt4uSsw"
        },
        {
            "name": "The Greed of the Soul",
            "episode": 9,
            "description":"Sh. Omar Suleiman talks about the supplication of Abdulrahman ibn ‘Auf, one of the richest men at the time of the Prophet ﷺ, and how to refrain from the temptations of greed ourselves. \n[ Day 9 Du'a ] \nاللَّهُمَّ قِنِي شُحَّ نَفْسِي\n“O Allah, protect me from the greed of my soul!”",
            "youtube_id": "Hac1gKT7juk",
            "url": "https://youtu.be/Hac1gKT7juk"
        },
        {
            "name": "A Prayer More Powerful Than the Wind",
            "episode": 10,
            "description":"This episode discusses a du'a that Ibrahim ibn Adham made upon bearing witness to Allah's power, and how it may help us frame difficult situations in a positive light. \n[ Day 10 Du'a ]\nأَرَيْتَنَا قُدْرَتَكَ فَأَرِنَا عَفْوَكَ\n“You have shown us Your power, so show us Your forgiveness.”",
            "youtube_id": "yyEEpDSYJts",
            "url": "https://youtu.be/yyEEpDSYJts"
        },
        {
            "name": "Don’t Punish a Tongue of Praise",
            "episode": 11,
            "description":"This episode's du'a from Imam ibn al-Jawzi encourages us to do good and to share knowledge, then invoke Allah with our good deeds in prayer. \n[ Day 11 Du'a]\nإِلَهِيْ لَا تُعَذِّبْ لِسَاناً يُخْبِرُ عَنْكَ، وَلا عَيْناً تَنْظُرُ إِلَى عُلُوْمٍ تَدُلُّ عَلَيْكَ ، وَلا يَداً تَكْتُبُ حَدِيْثَ رَسُوْلِكَ؛ فَبِعِزَّتِكَ لا تُدْخِلَنِي النَّارَ\n“My God, do not punish a tongue that informs about You, nor an eye that looks upon (Islamic) sciences which point to You, nor a hand that writes the traditions of Your Messenger. So by Your honor, do not admit me into the Fire.”",
            "youtube_id": "TwVQp29iixo",
            "url": "https://youtu.be/TwVQp29iixo"
        },
        {
            "name": "Don’t Make an Example Out of Me",
            "episode": 12,
            "description":"Sh. Omar Suleiman relates the du'a in the last episode to the prayer of another great man. Where ibn al-Jawzi worried his students would not find him in paradise, al-Mutarraf ibn Abdullah worried he would be made into a bad example for others. \n[ Day 12 Du'a]\nاللَّهُمَّ لا تَجْعَلْنِيْ عِبْرَةً لِغَيْرِيْ ، وَلا تَجْعَلْ أَحَداً أَسْعَدَ بِمَا عَلَّمْتَنِيْ مِنِّيْ \n“O Allah, do not make a lesson out of me for others, and do not let there be anyone who benefits more than me from what You’ve taught me.”",
            "youtube_id": "IN3qvz2bmpI",
            "url": "https://youtu.be/IN3qvz2bmpI"
        },
        {
            "name": "A Station of Patience Without Trial",
            "episode": 13,
            "description":"Sh. Omar Suleiman covers the prayer of Salaam ibn Mutee’, whose du'a encourages us to have faith that Allah is capable of granting you the best of this life and the next. \n[ Day 13 Du'a ]\nاللَّهُمَّ إِنْ كُنْتَ بَلَغْتَ أَحَداً مِنْ عِبَادِكَ الصَّالِحِيْنَ دَرَجَةً بِبَلَاءٍ فَبَلِّغْنِيْهَا بِالعَافِيَةِ\n“O Allah, if you have granted any righteous servant of Yours a station because of a trial they faced, then grant it to me while sparing me that trial.”",
            "youtube_id": "pEQzh340n98",
            "url": "https://youtu.be/pEQzh340n98"
        },
        {
            "name": "My Evil vs. His Good",
            "episode": 14,
            "description":"This episode's prayer is about acknowledging to Allah the bad deeds we have done to invoke the good that He can bring to us. \n[ Day 14 Du'a ]\nاللَّهُمَّ لا تَحْرِمْنِي خَيْرَ مَا عِنْدَكَ لِشَرِّ مَا عِنْدِي\n“O Allah don't forbid me from the good you have, for the evil I have.”",
            "youtube_id": "usAJUYBCe9Q",
            "url": "https://youtu.be/usAJUYBCe9Q"
        },
        {
            "name": "The Prayer of a Tree",
            "episode": 15,
            "description":"Sh. Omar Suleiman reflects upon a prayer made by a tree and the beauty of prostration. \n[ Day 15 Du'a ]\nاللّهُمّ اكتُبْ لي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّيْ بِهَا وِزْراً، وَاجْعَلْهَا لِيْ عِندَكَ ذُخْراً، وَتَقَبّلْهَا مِنِّيْ كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ عَلَيْهِ الصَّلاةُ والسَّلامُ\n“O Allah, write for me a reward with You because of it (the prostration), and remove from me a sin because of it, and stow it for me as a treasure with You, and accept it from me as You accepted it from Your servant David (Dawud), upon him be blessings and peace.”",
            "youtube_id": "QExGsrRV2Q0",
            "url": "https://youtu.be/QExGsrRV2Q0"
        },
        {
            "name": "A House on Fire",
            "episode": 16,
            "description":"Sh. Omar Suleiman reflects upon the story of a burning town, and the power of making du’a with conviction and trust in Allah. \n[ Day 16 Du'a ] \nبِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ\n“In the name of Allah; with His name, nothing whatsoever on earth or heaven can inflict any harm; He is All-Hearing and All-Knowing.”",
            "youtube_id": "-GpWapjonEM",
            "url": "https://youtu.be/-GpWapjonEM"
        },
        {
            "name": "His Prayer Amazed the Prophet ﷺ",
            "episode": 17,
            "description":"This du’a is from an unknown Bedouin who called to Allah with so much praise he amazed the Prophet ﷺ.\n[ Day 17 Du'a ]\nيَا مِنْ لا تَرَاهُ العُيُوْنُ، وَلا تُخَالِطُهُ الظُّنُوْنُ، وَلا يَصِفُهُ الوَاصِفُوْنَ، وَلا تُغَيِّرُهُ الحَوَادِثَ، وَلا يَخْشَى الدَّوَائِرَ، يَعْلَمُ مَثَاقِيْلَ الجِبَالِ، وَمَكايِيْلَ البِحَارِ، وَعَدَدَ قَطَرِ الأَمْطَارِ، وَعَدَدَ وَرَقِ الأَشْجَارِ، وَعَدَدَ مَا أَظْلَمَ عَلَيْهِ اللَّيْلُ وَأَشْرَقَ عَلَيْهِ النَّهَارُ، وَلا تُوَارِيْ مِنْهُ سَمَاءٌ سَمَاءً، وَلا أَرْضٌ أَرْضاً، وَلا بَحَرٌ مَا فِيْ قَعْرِهِ، وِلا جَبَلٌ مَا فِيْ وَعْرِهِ، اجْعَلْ خَيْرَ عُمْرِيْ آخِرَهُ، وَخَيْرَ عَمَلَيْ خَوَاتِيْمَهُ، وَخَيْرَ أَيَّامِيْ يِوْمَ أَلقاكَ فِيْهِ\n“Oh He whom the eyes do not see, nor can be mixed with doubts, nor can be described by any who describe, nor is changed by any events, nor fears any officer, who knows the weights of the mountains, the measurements of the seas, the number of raindrops, the number of leaves on trees, and the number of whatever is shrouded in the darkness of night and brightened by the light of day, for whom no heaven or earth is concealed, nor a sea in its depths, nor a mountain in its ruggedness! Make the best of my life the end of it, the best of my deeds the last of them, and the best of my days the Day I meet You.”",
            "youtube_id": "rPzFVeanrOs",
            "url": "https://youtu.be/rPzFVeanrOs"
        },
        {
            "name": "A Reminder of My Illness",
            "episode": 18,
            "description":"This episode talks about being grateful to Allah and remembering the promises we make to Him. Sh. Omar Suleiman explains this lesson through the prayer of Uwais al-Qarni.\n[ Day 18 Du'a ] \n\"Oh Allah cure all of my leprosy except for the space of a coin.\"",
            "youtube_id": "jDKT8KirWe4",
            "url": "https://youtu.be/jDKT8KirWe4"
        },
        {
            "name": "Make Me Better Than What They Think",
            "episode": 19,
            "description":"This episode is one that especially applies to those in the public eye. Sh. Omar Suleiman discusses the dangers of destructive praise and the prayer Abu Bakr made to avoid it.\n[ Day 19 Du'a ] \nاللَّهُمَّ اجْعَلْنِى خَيْرًا مِمَّا يَظُنُّونَ وَاغْفِرْ لِى مَا لَا يَعْلَمُونَ وَلَا تُؤَاخِذْنِى بِمَا يَقُولُون\n“O Allah, make me better than what they think of me, and forgive me for what they do not know about me, and do not take me to account for what they say about me.”",
            "youtube_id": "KP3ijS-74cI",
            "url": "https://youtu.be/KP3ijS-74cI"
        },
        {
            "name": "Don't Ask Allah for Patience",
            "episode": 20,
            "description":"In this episode, Sh. Omar Suleiman goes over a narration that gives us insight into some do’s and don’ts of du’a, especially about praying for patience. \n[ Day 20 Du'a ]\nحَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الْوَرْدِ، عَنِ اللَّجْلاَجِ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ سَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً يَدْعُو يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ تَمَامَ النِّعْمَةِ . فَقَالَ \" أَىُّ شَيْءٍ تَمَامُ النِّعْمَةِ \" . قَالَ دَعْوَةٌ دَعَوْتُ بِهَا أَرْجُو بِهَا الْخَيْرَ . قَالَ \" فَإِنَّ مِنْ تَمَامِ النِّعْمَةِ دُخُولَ الْجَنَّةِ وَالْفَوْزَ مِنَ النَّارِ \" . وَسَمِعَ رَجُلاً وَهُوَ يَقُولُ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ فَقَالَ \" قَدِ اسْتُجِيبَ لَكَ فَسَلْ \" . وَسَمِعَ النَّبِيُّ صلى الله عليه وسلم رَجُلاً وَهُوَ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ الصَّبْرَ . فَقَالَ \" سَأَلْتَ اللَّهَ الْبَلاَءَ فَسَلْهُ الْعَافِيَةَ \" \nحَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنِ الْجُرَيْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ . قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ \nMu`adh bin Jabal narrated that the Prophet heard a man supplicating, saying: “O Allah! Verily, I ask You for the bounty’s completion (Allāhumma, innī as’aluka tamāman-ni`mah).” So he said: “What thing is the bounty’s completion?” He said: “A supplication that I made, that I hope for good by it.” He said: “Indeed, part of the bounty’s completion is the entrance into Paradise, and salvation from the Fire.” And he heard a man while he was saying: “O Possessor of Majesty and Honor (Yā Dhal-Jalāli wal- Ikrām)” So he said: “You have been responded to, so ask.” And the Prophet heard a man while he was saying: “O Allah, indeed, I ask You for patience (Allāhumma, innī as’alukaṣ-ṣabr)” He said: “You have asked Allah for trial, so ask him for Al-`Āfiyah.”",
            "youtube_id": "dsPW2Xpev50",
            "url": "https://youtu.be/dsPW2Xpev50"
        },
        {
            "name": "Death After Fajr",
            "episode": 21,
            "description":"This episode talks about the beauty in asking Allah for a good ending with an example of a du’a from Abdullah ibn Abi Sarh. \n[ Day 21 Du'a ] \nاللَّهُمَّ اجْعَلْ خَاتِمَةَ عَمَلِيْ صَلاةَ الفَجْرِ\n“O Allah! Make my last deed in this life the performance of Fajr prayer”",
            "youtube_id": "8mkx1b8jhRQ",
            "url": "https://youtu.be/8mkx1b8jhRQ"
        },
        {
            "name": "Your Perfect Light",
            "episode": 22,
            "description":"This episode walks us through the beautiful nightly prayer of Ali ibn Abi Talib and the beauty of praising Allah.   \n[ Day 22 Du'a ]\nتَمَّ نُورُكَ فَهَدَيْتَ فَلَكَ الْحَمْدُ , عَظُمَ حِلْمُكَ فَعَفَوْتَ ، فَلَكَ الْحَمْدُ , وَبَسَطْتَ يَدَكَ فَأَعْطَيْتَ فَلَكَ الْحَمْدُ , رَبَّنَا وَجْهُكَ أَكْرَمُ الْوُجُوهِ ، وَجَاهُكَ خَيْرُ الْجَاهِ ، وَعَطِيَّتُكَ أَفْضَلُ الْعَطِيَّةِ وَأَهْنَأُهَا ، تُطَاعُ رَبَّنَا فَتَشْكُرُ ، وَتُعْصَى رَبَّنَا فَتَغْفِرُ لِمَنْ شِئْتَ ، تُجِيبُ الْمُضْطَرَّ ، وَتَكْشِفُ الضُّرَّ ، وَتَشْفِي السَّقِيمَ ، وَتُنْجِي مِنَ الْكَرْبِ ، وَتَقْبَلُ التَّوْبَةَ ، وَتَغْفِرُ الذُّنُوبَ ، لا يَجْزِي بِآلائِكَ وَلا يُحْصِي نَعْمَاءَكَ قَوْلُ قَائِلٍ \n“Your light was complete, so You guided; all praise is to You. Your forbearance was great, so You forgave; all praise is to You. You held out Your Hand, so You gave; all praise is to You. Our Lord, Your face\nis the noblest of faces, Your prestige is the greatest prestige, and\nYour gifts are the best of gifts and the most wonderful. Our Lord, You are obeyed and You show appreciation. You are disobeyed, Our Lord, yet you pardon whomever. You respond to one in hardship and you remove harm. You heal the sick. You deliver from difficulty. You accept repentance. You forgive sins. The word of no one can compensate for your bounties, nor count the praises You deserve.”",
            "youtube_id": "XVXDQag68O8",
            "url": "https://youtu.be/XVXDQag68O8"
        },
        {
            "name": "My Sincerity to Your Creation",
            "episode": 23,
            "description":"We may do good deeds to help others, but how is our sincerity in our private lives? Sh. Omar Suleiman covers the beautiful du’a of Yusuf ibn al-Hussein. \n[ Day 23 Du'a ]\nاللَّهُمَّ إِنِّيْ نَصَحْتُ لِخَلْقِكَ ظَاهِراً وَغَشَشْتُ نَفْسِيْ بَاطِناً ، فَهَبْ لِيْ غِشِّيْ نَفْسِيْ لِنُصْحِيْ لِخَلْقِكَ\n“O Allah, I was sincere to Your creation in public but cheated myself in private. Please excuse my disgrace because of my sincerity to Your creation.”",
            "youtube_id": "CckwW1EW880",
            "url": "https://youtu.be/CckwW1EW880"
        },
        {
            "name": "Your Beautiful Veil",
            "episode": 24,
            "description":"This episode covers the beautiful du’a of Sufyan ibn ‘Uyaynah, and the benefits of privatizing our good deeds as we do our sins. \n[ Day 24 Du'a ]\nاللَّهُمَّ اسْتُرْنَا بِسِتْرِكَ الجَمِيْلِ ، وَاجْعَلْ تَحْتَ السِّتْرَ مَا تَرْضَى بِهِ عَنَّا\n“O Allah, veil us with Your beautiful veil and place beneath that veil what will please You from us.”",
            "youtube_id": "O5mJlYLGMBs",
            "url": "https://youtu.be/O5mJlYLGMBs"
        },
        {
            "name": "Oh Teacher of Abraham",
            "episode": 25,
            "description":"Sh. Omar Suleiman covers a prayer narrated by Imam ibn al-Qayyim that highlights Allah’s power to grant knowledge and wisdom.\n[ Day 25 Du'a ] \nيا مُعَلِّمَ إِبْرَاهِيْمَ عَلِّمْنِيْ\n“Oh Teacher of Abraham! Teach me!\"",
            "youtube_id": "aAlY_nzizQg",
            "url": "https://youtu.be/aAlY_nzizQg"
        },
        {
            "name": "You Are You, and I Am Me",
            "episode": 26,
            "description":"This du’a is an example of how making du’a to Allah doesn’t have to be complicated, and the beauty behind the process of supplicating. \n[ Day 26 Du'a ] \nاللَّهُمَّ أَنْتَ أَنْتَ وَأَنَا أَنَا أَنْتَ الْعَوَّادُ بِالْمَغْفِرَةِ وَأَنَا الْعَوَّادُ بِالذُنُوبِ فَاغْفِرْ لِي\n“O Allah, You are who You are, and I am who I am; You are the One who keeps forgiving, and I am the one who keeps sinning, so forgive me!”",
            "youtube_id": "ruIXPopgu9I",
            "url": "https://youtu.be/ruIXPopgu9I"
        },
        {
            "name": "You Took My Kids",
            "episode": 27,
            "description":"Sh. Omar Suleiman reflects upon the righteous du’a of Umar ibn abd al-’Aziz after he suffered the loss of his children. \n[ Day 27 Du'a ] \nاللَّهُمَّ إِنَّكَ قَدْ قَبَضْتَ سَهْلاً، وَعَبْدَ المَلِكَ، وَمُزَاحِما، فَلَمْ أَزْدَدْ لَكَ إِلَّا حُبّاً، ولا فِيْمَا عِنْدَكَ إِلَّا رَغْبَةً فَاقْبِضْنِيْ إِلَيْكَ غَيْرَ مُضِيعٍ وَلا مُفْرِطٍ\n“O Allah, you took back the soul of Sahl, AbdulMalik, and Muzahim, and it only made me love You more, and more desirous of what awaits with you, so take back my soul without me being negligent or careless.”",
            "youtube_id": "YZ1u05xm81o",
            "url": "https://youtu.be/YZ1u05xm81o"
        },
        {
            "name": "If You Have Written Me From The Sinful...",
            "episode": 28,
            "description":"Can you change what has been decreed? This episode covers Umar’s prayer to be written amongst those who have been blessed.  \n[ Day 28 Du'a ]\nاللَّهُمَّ إِنْ كُنْتَ كَتَبْتَنِي فِي أَهْلِ السَّعَادَةِ فَأَثْبِتْنِي فِيهَا وَإِنْ كُنْتَ كَتَبْتَ عَلَيَّ الذَّنْبَ وَالشِّقْوَةَ فَامْحُنِي وَأَثْبِتْنِي فِي أَهْلِ السَّعَادَةِ فَإِنَّكَ تَمْحُو مَا تَشَاءُ وَتُثْبِتُ وَعِنْدَكَ أُمُّ الْكِتَابِ\n“O Allah, if you have written me among the blessed, then affirm it therein. And if you have written me among the sinful and the damned, then wipe it away and affirm me among the blessed. Verily, you wipe away and affirm whatever you will, and with you is the mother of the Book.”",
            "youtube_id": "fOdnMBDFGPs",
            "url": "https://youtu.be/fOdnMBDFGPs"
        },
        {
            "name": "Beautify Me Internally",
            "episode": 29,
            "description":"Why would Abu Darda’ pray all night for good character? Sh. Omar Suleiman discusses the benefits of this pious man’s supplication. \n[ Day 29 Du'a ]\n اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي\n“O Allah, as you have beautified me externally, beautify me internally.”",
            "youtube_id": "EfV_fIiwHWQ",
            "url": "https://youtu.be/EfV_fIiwHWQ"
        },
        {
            "name": "Show Us Guidance and Error",
            "episode": 30,
            "description":"In the final episode of the Prayers of the Pious series, Sh. Omar Suleiman reflects upon the du’a of Umar and praying for guidance. \n[ Day 30 Du'a ]\n اللَّهُمَّ أَرِنِ الحَقَّ حَقّاً وَوَفِّقْنِيْ لأِتِّبَاعِهِ، وَأَرِنِ البَاطِلَ بَاطِلاً وَوَفِّقْنِيْ لِاجْتِنَابِهِ\n“O Allah show me guidance as guidance, and allow me to follow it. And show me error as error, and allow me to avoid it.”",
            "youtube_id": "cOTicn0LLgA",
            "url": "https://youtu.be/cOTicn0LLgA"
        }
    ]
}